Autodesk.Revit.CurveAPIUtils.CreateHermiteSpline(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.HermiteSplineTangents)
Creates a Hermite spline with specified tangency at its endpoints.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
tangents:
The object which indicates tangency at the start, the end, or both ends of the curve.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateHermiteSpline(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean)
Creates a Hermite spline with default tangency at its endpoints.
Remarks:
The tangents at the ends of the spline are computed from the control points.
controlPoints:
The control points of the Hermite spline.
periodic:
True if the Hermite spline is to be periodic, false otherwise.
Returns:
The new HermiteSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The control points array is invalid, because it doesn't contain the minimum number of points (2).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to construct valid HermiteSpline from given inputs.
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateNurbSpline(Autodesk.Revit.DB.HermiteSpline)
Creates a new geometric NurbSpline by converting the given HermiteSpline.
hermiteSpline:
The HermiteSpline that will be converted.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given hermite spline has to be non-periodic.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.CurveAPIUtils.CreateNurbSpline_obsolete(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double})
Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
This function is made obsolete from 2017. Use a version of createNurbsCurve instead.
Remarks:
Knots and degree of the spline are computed from the control points and weights.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The control points array must contain at least 2 points.
-or-
The number of weights must be the same as the number of control points and all weights must be positive.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateNurbSpline_obsolete(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double},System.Collections.Generic.IList{System.Double},System.Int32,System.Boolean,System.Boolean)
Creates a new geometric NURBSpline object.
This function is made obsolete from 2017. Use a version of createNurbsCurve instead.
Remarks:
Degree must be 3 or greater.  If rational, the control points and weights array must be the same size.
There must be at least degree+1 control points.
The size of knots must equal the sum of degree, the size of the controlPoints array and 1. The first
degree+1 knots should be identical, as should the last degree+1 knots.
The knots in the middle of the sequence must be non-decreasing.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
knots:
The knots of the NURBSpline.
degree:
The degree of the NURBSpline.
closed:
True if the NURBSpline should be closed, false otherwise.
rational:
True if the NURBSpline is rational, false if it is irrational.
Returns:
The new NURBSpline object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Degree must be >= 1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
For rational spline, the number of weights must be the same as the number of control points and all weights must be positive.
For non-rational spline, the weights array is empty or the number of weights must be the same as the number of control points and all weights must be equal and non-negative.
-or-
The control points array must contain at least degree + 1 points.
-or-
The size of knots must equal the sum of degree, the size of the controlPoints array and 1.
The knot sequence must be non-decreasing.
The first degree+1 knots should be identical, as should the last degree+1 knots.
The knot multiplicity of an interior knot must not exceed degree minus 2.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateNurbsCurve(Autodesk.Revit.DB.HermiteSpline)
Creates a new geometric Curve object by converting the given HermiteSpline.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
The function does not support periodic Hermite curve.
hermiteSpline:
The HermiteSpline that will be converted.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given hermite spline has to be non-periodic.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.CurveAPIUtils.CreateNurbsCurve(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double})
Creates a new geometric Curve object from NURBS curve data containing just control points and weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
There must be at least 2 control points.
The number of weights must be equal to the the number of control points.
The values of all weights must be positive.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The number of control points must be at least 2.
-or-
The number of weights must be the same as the number of control points and all weights must be positive.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.CurveAPIUtils.CreateNurbsCurve(System.Int32,System.Collections.Generic.IList{System.Double},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Double})
Creates a new geometric Curve object from NURBS curve data, which includes weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
Degree must be 1 or greater.
The number of control points must be greater than degree.
The number of knots must equal the sum of degree, number of controlPoints and 1.
The distinct knot values (ignoring multiplicities) must be in increasing order.
The start and end knots must have multiplicity equal to degree + 1.
The multiplicities of other interior knots must be at most degree - 2.
The number of weights must be equal to the the number of control points.
The values of all weights must be positive.
degree:
The degree of the NURBSpline.
knots:
The knots of the NURBSpline.
controlPoints:
The control points of the NURBSpline.
weights:
The weights of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The degree must be at least 1.
-or-
The number of control points must be greater than degree.
-or-
The number of knots must equal the sum of number of control points, degree and 1.
-or-
An interior knot must not repeat itself more than degree times.
-or-
The number of weights must be the same as the number of control points and all weights must be positive.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.CurveAPIUtils.CreateNurbsCurve(System.Int32,System.Collections.Generic.IList{System.Double},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a new geometric Curve object from NURBS curve data, which does not include weights.
The created curve may be a NURBSpline or a simpler curve such as line or arc.
Remarks:
Degree must be 1 or greater.
The number of control points must be greater than degree.
The number of knots must equal the sum of degree, number of controlPoints and 1.
The distinct knot values (ignoring multiplicities) must be in increasing order.
The start and end knots must have multiplicity equal to degree + 1.
The multiplicities of other interior knots must be at most degree - 2.
degree:
The degree of the NURBSpline.
knots:
The knots of the NURBSpline.
controlPoints:
The control points of the NURBSpline.
Returns:
The new Curve object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The degree must be at least 1.
-or-
The number of control points must be greater than degree.
-or-
The number of knots must equal the sum of number of control points, degree and 1.
-or-
An interior knot must not repeat itself more than degree times.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.CurveAPIUtils.CreateEllipse(Autodesk.Revit.DB.XYZ,System.Double,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Boolean)
Creates a new geometric ellipse or elliptical arc object.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded ellipse.
If allowSimplification is true and the xRadius and yRadius parameters are almost
equal, it will return an arc instead of an ellipse.
center:
The center.
xRadius:
The x vector radius of the ellipse.
yRadius:
The y vector radius of the ellipse.
xAxis:
The x axis to define the ellipse plane.  Must be normalized.
yAxis:
The y axis to define the ellipse plane.   Must be normalized.
startParameter:
The raw parameter value at the start of the ellipse.
endParameter:
The raw parameter value at the end of the ellipse.
allowSimplification:
If true, create an arc if xRadius and yRadius are almost equal.
Returns:
The new ellipse or elliptical arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for xRadius must be greater than 0 and no more than 30000 feet.
-or-
The given value for yRadius must be greater than 0 and no more than 30000 feet.
-or-
xAxis is not length 1.0.
-or-
yAxis is not length 1.0.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors xAxis and yAxis are not perpendicular.
-or-
Start parameter must be less than end parameter.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateArc(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric arc object based on three points.
end0:
The start point of the arc.
end1:
The end point of the arc.
pointOnArc:
A point on the arc.
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors end0 and end1 are coincident.
-or-
The vectors end0 and pointOnArc are coincident.
-or-
The vectors end1 and pointOnArc are coincident.
-or-
Cannot create an arc.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateArc(Autodesk.Revit.DB.Plane,System.Double,System.Double,System.Double)
Creates a new geometric arc object based on plane, radius, and angles.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded circle.
plane:
The plane which the arc resides. The plane's origin is the center of the arc.
radius:
The radius of the arc.
startAngle:
The start angle of the arc (in radians).
endAngle:
The end angle of the arc (in radians).
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for radius must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Start angle must be less than end angle.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateArc(Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric arc object based on center, radius, unit vectors, and angles.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded circle.
center:
The center of the arc.
radius:
The radius of the arc.
startAngle:
The start angle of the arc (in radians).
endAngle:
The end angle of the arc (in radians).
xAxis:
The x axis to define the arc plane. Must be normalized.
yAxis:
The y axis to define the arc plane. Must be normalized.
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xAxis is not length 1.0.
-or-
yAxis is not length 1.0.
-or-
The given value for radius must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors xAxis and yAxis are not perpendicular.
-or-
Start angle must be less than end angle.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateUnboundLine(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of an unbound linear curve.
origin:
The origin of the unbound line.
direction:
The direction of the unbound line.
Returns:
The new unbound line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
direction has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Vector and origin cannot form a proper unbound line.
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateBoundLine(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of a bound linear curve.
endpoint1:
The first line endpoint.
endpoint2:
The second line endpoint.
Returns:
The new bound line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.CurveAPIUtils.CreateTransformed(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Transform)
Crates a new instance of a curve as a transformation of an input curve.
curve:
The curve to be copied and transformed.
transform:
The transform to apply.
Returns:
The new curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
Since:
2014

Autodesk.Revit.CurveAPIUtils.ComputeCurveDerivatives(Autodesk.Revit.DB.Curve,System.Double,System.Boolean)
Returns the vectors describing the curve at the specified parameter.
Remarks:
The following is the meaning of the transformation members:
Origin is the point on the curve (equivalent to Evaluate).BasisX is the tangent vector (the first derivative).BasisY is the second derivative.  Note that for curves where this cannot be uniquely determined (e.g. lines), this will be a Zero vector.BasisZ is the bi-normal vector (tangent x normal). Note that for curves where normal cannot be uniquely determined (e.g. lines), this will be a Zero vector.
None of the vectors are normalized.
curve:
The curve.
parameter:
The parameter to be evaluated.
normalized:
If false, param is interpreted as natural parameterization of the curve.
If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The transformation containing the point on the curve, the tangent vector, derivative of tangent vector, and bi-normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.

Autodesk.Revit.CurveAPIUtils.EvaluateCurve(Autodesk.Revit.DB.Curve,System.Double,System.Boolean)
Evaluates and returns the point that matches a parameter along the curve.
curve:
The curve.
parameter:
The parameter to be evaluated.
normalized:
If false, param is interpreted as natural parameterization of the curve.
If true, param is expected to be in [0,1] interval mapped to the bounds of the curve. Setting to true is valid only if the curve is bound.
Returns:
The point evaluated along the curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for parameter is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The curve cannot be evaluated as normalized because it is unbound.
-or-
The parameter is not a valid value for normalized evaluation.

Autodesk.Revit.CurveAPIUtils.GetCurveEndParameter(Autodesk.Revit.DB.Curve,System.Int32)
Returns the raw parameter value at the start or end of this curve.
Remarks:
The start and end value of the parameter can be any value (as it is determined by Revit based on the parameterization of related geometry, or
based on calculations necessary to produce the geometry).
For curves with regular curvature like lines and arcs, the raw parameter can be used to measure along the curve in Revit's default units (feet).
Raw parameters are also the only way to evaluate points along unbound curves.
curve:
The curve.
index:
0 for the start or 1 for end of the curve.
Returns:
The parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.CurveAPIUtils.GetCurveEndpoint(Autodesk.Revit.DB.Curve,System.Int32)
Returns the 3D point at the start or end of this curve.
curve:
The curve.
index:
0 for the start or 1 for end of the curve.
Returns:
The curve endpoint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.CurveAPIUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.CurveAPIUtils
Contains native implementations of curve related functions exposed to API.
Remarks:
All of the static methods contained within logically belong within the API in Curve or one of its subclasses.
The internal API wrappers are called directly by the related public API methods.